tests/mutants/s-gate-03.patch
# S-GATE 03. Unparseable stdin goes back to being an ALLOW instead of a refusal: the `lane`
# defect: guard in front of the unchecked-allow return is inverted, so a payload the gate
# defect: could not read is waved through with a trace rather than denied. One character.
#
# WHY THIS SHAPE. The trace is deliberately left intact, so this cannot be confused with "the
# diagnostic stopped being written": everything the three renamed trace checks assert still
# happens, and they are declared green below. What breaks is only the VERDICT -- which is the
# reversal WORK-ISOLATION-PLAN section 9 required and the ancestor check's own comment records
# at length: layer 1 has nothing behind it, so a write it could not adjudicate cannot be let
# into the operator's live tree.
#
# THE PAIRED REDS (plan 5.3):
#
# expects-red: m1:unreadable_input_is_refused_not_allowed_into_the_live_tree
# expects-red: unit:Dodona.Tests.GateDecisionTests.unreadable_input_is_refused_not_allowed_into_the_live_tree
# expects-red: unit:Dodona.Tests.GateDecisionTests.every_allow_asked_the_tree_or_had_no_gate_deployed
#
# THE CONTROLS. The trace still fires, and nothing about the arguments changed:
#
# expects-green: m1:the_unreadable_input_trace_says_why
# expects-green: m1:the_unreadable_input_trace_says_how_much_it_got
# expects-green: m1:the_unreadable_input_trace_reaches_the_bypass_log
# expects-green: m1:the_gate_denies_a_lane_argument_it_cannot_read
# expects-green: unit:Dodona.Tests.GateDecisionTests.the_gate_denies_a_lane_argument_it_cannot_read
diff --git a/src/Dodona/Program.cs b/src/Dodona/Program.cs
index 7d30e6f..0b55447 100644
--- a/src/Dodona/Program.cs
+++ b/src/Dodona/Program.cs
@@ -1841,7 +1841,7 @@ namespace Dodona
                 // recorded so the next occurrence answers the question instead of raising it again.
                 var head = input.Length > 120 ? input.Substring(0, 120) + "..." : input;
                 var why = $"stdin unparseable as JSON ({input.Length} bytes, {ex.GetType().Name}): {Flatten(head)}";
-                if (lane <= 0) return new Outcome(Verdict.Allow, null, why, note, ticket, null);
+                if (lane >= 0) return new Outcome(Verdict.Allow, null, why, note, ticket, null);
                 return new Outcome(
                     Verdict.Deny,
                     "dodona gate: the tool payload did not parse, so the gate cannot tell which tree this " +
