tests/mutants/s-store-04.patch
# S-STORE 04. The grant stops asking whether anybody holds it (plan 9.4 step B0).
#
# defect: the grant condition drops `t.Holder is null` and keeps only `head == ticketId`, so a
# defect: queued ticket at the head takes the token OUT FROM UNDER a live holder.
#
# WHY THIS SHAPE. This is the exact race the merge token exists to prevent -- two tickets
# holding one repository's main at once -- and it is reached by deleting half of one condition.
# `LandCommit` re-checks holder identity inside the landing transaction (plan 3.5's reason
# `Store` is never faked), so the SECOND holder lands and the first is fenced out of its own
# grant: the queue's whole purpose inverted, with nothing raising an error.
#
# The control is the first grant, where holder IS null, so the red belongs to the missing
# holder test and not to the head test beside it.
#
# expects-red: unit:Dodona.Tests.StoreTokenTests.second_ticket_queued
# expects-green: m1:approved_token_granted
# expects-green: unit:Dodona.Tests.StoreTokenTests.approved_token_granted
diff --git a/src/Dodona/Store.cs b/src/Dodona/Store.cs
index c265d08..8b2837c 100644
--- a/src/Dodona/Store.cs
+++ b/src/Dodona/Store.cs
@@ -1466,7 +1466,7 @@ sealed class Store : IDisposable, ILaneSink
                 head = (long)c.ExecuteScalar()!;
             }
 
-            if (t.Holder is null && head == ticketId)
+            if (head == ticketId)
             {
                 var sha = mainSha();
                 using var c = _db.CreateCommand();
