tests/mutants/s-poller-01.patch
# S-POLLER 01 (plan W8, 9.4 step B0).
#
# defect: the elapsed clock's ten-second threshold becomes an hour, so a lane that is genuinely
# defect: working never shows a moving clock at all -- `working` sits there static, which is
# defect: exactly the failure docs/LANE-LIFECYCLE.md sec 5 added the clock to prevent
# defect: ("a static `working...` looks identical whether the agent is thinking hard or wedged").
#
# WHY A THRESHOLD AND NOT A FORMAT STRING. A wrong threshold is the defect this function can
# really have: every branch below it still works, the type is unchanged, nothing throws, and a
# live window still renders a plausible tile. The compiler cannot see it and neither can a
# screenshot. It is aimed at ONE decision -- the withholding -- and the quota line beside it in
# the same class is declared green to prove the aim.
#
# THE PAIRED RED (plan 5.3). Before deletion, this same patch reddened the acceptance ancestor
# through a live WPF window, a daemon, a shim and a real fourteen-second agent turn.
#
# expects-red: ui-grid:liveness_shows_a_moving_clock
# expects-red: ui-unit:Dodona.Ui.Tests.PollerLivenessTests.liveness_shows_a_moving_clock
#
# expects-green: ui-unit:Dodona.Ui.Tests.PollerQuotaTests.quota_line_from_wire
# expects-green: ui-grid:badge_flushes_at_turn_end
diff --git a/src/DodonaUi/Poller.cs b/src/DodonaUi/Poller.cs
index 067d9e4..95dfffa 100644
--- a/src/DodonaUi/Poller.cs
+++ b/src/DodonaUi/Poller.cs
@@ -71,7 +71,7 @@ sealed class Poller
         if (!busy || lastSeen is null) return presence;
 
         var s = (long)(now - lastSeen.Value).TotalSeconds;
-        if (s < 10) return presence;
+        if (s < 3600) return presence;
         if (s >= 300) return $"quiet {s / 60}m ({presence})";
         s -= s % 10;
         return $"{presence} {(s >= 60 ? $"{s / 60}m{s % 60:00}s" : $"{s}s")}";
